Tekla Open API Reference for Tekla Structures 2025
Rectangle Constructor (ViewBase, Point, Double, Double, Rectangle.RectangleAttributes)
 Creates a new rectangle instance with the start point and the defined width and height using the given attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Rectangle(
	ViewBase view,
	Point startPoint,
	double width,
	double height,
	Rectangle.RectangleAttributes attributes
)
Public Sub New (
	view As ViewBase,
	startPoint As Point,
	width As Double,
	height As Double,
	attributes As Rectangle.RectangleAttributes
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
startPoint
Type: Tekla.Structures.Geometry3d.Point
The start point to be used.
width
Type: System.Double
The width to be used.
height
Type: System.Double
The height to be used.
attributes
Type: Tekla.Structures.Drawing.Rectangle.RectangleAttributes
The rectangle attributes to be used.
See Also
Reference
Rectangle Class
Rectangle Overload
Tekla.Structures.Drawing Namespace